[
  "dataview",
  "table-editor-obsidian",
  "obsidian-git",
  "obsidian-minimal-settings",
  "cm-editor-syntax-highlight-obsidian",
  "omnisearch",
  "obsidian-spaced-repetition",
  "obsidian-map-view",
  "obsidian-code-block-enhancer",
  "obsidian-columns",
  "obsidian-better-command-palette",
  "obsidian-advanced-new-file",
  "text-extractor",
  "templater-obsidian"
]