{"id":108195,"xmlId":"com.codestream.jetbrains-codestream","name":"CodeStream: GitHub, GitLab, Bitbucket PRs and Code Review","description":"<p>CodeStream is a developer collaboration platform that integrates all of your essential dev tools, such as GitHub, GitLab, Bitbucket, Slack, Teams, Jira, Trello and more, into your IDE. Eliminate context-switching and simplify code discussion and code review by putting collaboration tools in your IDE.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/CodeStream/master/images/CSforJB2.png\" alt=\"CodeStream for JetBrains\"></p>\n\n<h1>Requirements</h1>\n<ul>\n    <li>CodeStream requires version 2019.2 or later of any JetBrains IDE, and is also available for [VS Code](https://marketplace.visualstudio.com/items?itemName=CodeStream.codestream), [Visual Studio](https://marketplace.visualstudio.com/items?itemName=CodeStream.codestream-vs) or [Atom](https://atom.io/packages/codestream).</li>\n    <li>Your repository must be managed by Git, or a Git hosting service like GitHub.</li>\n</ul>\n\n<h1>Guided Installation Option</h1>\n<p>Help us improve CodeStream for first-time users by participating in a 20-minute zoom call: screen-share while we guide you along the way and demonstrate CodeStream's capabilities. If you work on a team with at least 10 developers <a href=\"https://app.hubspot.com/meetings/claudio13/a-codestream-specialist-supports-your-onboarding-live\">please schedule a time here</a>.\n\n</p><h1>Create and Review Pull Requests in your IDE</h1>\n<p>Create, review and merge pull requests inside your IDE, with full source-tree and full file access, your favorite keybindings, built-in diff too, and code intelligence.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/PullRequest-JB.gif\" alt=\"Pull Request\"></p>\n\n<h1>Get Feedback on Work-in-Progress with Pre-PR Code Reviews</h1>\n<p>CodeStream's lightweight feedback requests let you get feedback on your changes regardless of the current state of your repo, without the friction of committing, pushing or issuing a pull request. Your teammates can review your changes right in their IDE, with full file context, and with no need to set aside their current work to switch branches or pull the latest.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/FRPerform-JB.gif\" alt=\"Review Changes\"></p>\n<br>\n<p>CodeStream’s feedback requests are so easy that you can start doing them throughout the development process instead of waiting until the end. You’re a few days into a sprint and have some work stubbed out? Maybe some work that hasn’t even been committed. Get feedback on your work-in-progress so that you can identify and resolve issues early instead of saving those gotchas for when you need to get the code merged.</p>\n\n<h1>Simplified Code Discussion</h1>\n<p>Rather than copying &amp; pasting, CodeStream enables in-editor commenting on any code in your repository, with optional sharing to Slack, Teams or via email, with automatic at-mentioning of code authors via git blame.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/DiscussCode1-JB.gif\" alt=\"Discuss Code\"></p>\n<br>\n<p>Your teammates can participate in the discussion right from their IDE, or from Slack, Teams, or replying to the email.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/CodeStream/master/images/ShareOnSlack1.png\" alt=\"Share on Slack\"></p>\n\n<h1>Build the Knowledge Base Behind Your Codebase</h1>\n<p>CodeStream turns conversation into documentation by capturing all of the discussion about your code, and saving it with your code. Comment and code review threads are automatically repositioned as your code changes, even across branches. All with zero effort on your part.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/KnowledgeBase1-JB.gif\" alt=\"Knowledge Base\"></p>\n<br>\n<p>Previously discussed questions and issues that explain important decisions are now accessible right where you need them, when you need them. Just click on the codemark to expand it and see how something works or why something was done a certain way.</p>\n\n<h1>Team Transparency through Live View</h1>\n<p>Development is a collaborative activity, yet much of it happens in isolation, with work only shared with the team at the end of a cycle, or sprint. CodeStream’s “LiveView” increases transparency by making the local edits of individual developers visible to team members, so that everyone knows what everyone else is working on, in real-time.</p>\n<br>\n<p>As developers write code, whether editing existing files or creating new files, a summary of their changes, including the repo(s), files, and lines changed is exposed to their teammates through CodeStream. The information is displayed contextually, in the IDE, and even warns teammates of potential merge conflicts… before they happen!</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/MyTeamSection-LiveView.png\" alt=\"Live View\"></p>\n\n<h1>Frequently Asked Questions</h1>\n\n<h4>Where are messages stored?</h4>\n<p>Your team’s codemarks, which include the message text and the code snippet, are stored in the cloud on CodeStream’s servers. CodeStream uses best practices when it comes to <a href=\"https://www.codestream.com/security\">security</a>, but if your team has stringent infosec requirements we also offer an <a href=\"https://docs.codestream.com/onprem/\">on-prem solution</a>.\n\n</p><h1>Help &amp; Feedback</h1>\n<p>Check out the <a href=\"https://docs.codestream.com/userguide/\">user guide</a> for more information on getting started with CodeStream. Please follow <a href=\"http://twitter.com/teamcodestream\">@teamcodestream</a> for product updates and to share feedback and questions. You can also email us at support@codestream.com.</p>\n<p>\n    <br>\n    <a title=\"Learn more about CodeStream\" href=\"https://codestream.com?utm_source=jbmarket&amp;utm_medium=banner&amp;utm_campaign=codestream\"><img src=\"https://alt-images.codestream.com/codestream_logo_jbmarketplace.png\" alt=\"CodeStream Logo\"></a>\n</p>","tags":["Code tools","Tools integration","TeamWork","Issue Trackers Integration","Issue View","Workflow","Comments","Code Quality","GitHub","Productivity"],"vendor":"CodeStream","version":"10.4.0+121","notes":"<h4>10.4.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for <a href=\"https://www.codestream.com/blog/codestream-10-4-file-attachments-github-status-checks\"></a>file attachments when creating comment or issue codemarks</li>\n    <li>Adds support for GitHub status checks in pull requests rendered in CodeStream</li>\n    <li>When selecting a Linear issue to start work, the branch name associated with the issue is used</li>\n    <li>Adds the ability to pull the latest, if the base branch is behind origin, when previewing diffs while creating a pull request</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Prevent the creation of codemarks when in a preview diff while submitting a feedback request</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/353\">#353</a> - Codemark glyphs do not show up in WSL environment</li>\n    <li>Fixes an issue where starting work on an issue creates a feature branch against the wrong base</li>\n    <li>Fixes a data integrity issue that led to a small group of users getting an error clicking on a codemark</li>\n    <li>Fixes with the fetching of too much history data from PubNub if client clock is inaccurately set</li>\n    <li>Performance improvements</li>\n    <li>Fixes an issue with feedback requests assigned to you not appearing in the Approved or Needs Work sections without a reload</li>\n</ul>\n<h4>10.3.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new integration with the Linear issue-tracking service</li>\n    <li>Adds an <a href=\"https://medium.com/teamcodestream/how-we-extended-gitlens-pull-request-functionality-in-visual-studio-code-f4dbecbea4c2\"></a>integration with GitLens which allows you to create and view pull requests using CodeStream</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/364\">#364</a> - Copy button in PR is copying the base branch name instead of the compare branch</li>\n    <li>Fixes an issue where the Open File button in the Tree View of the list of files in a PR wouldn't open the correct file if sections of the tree were collapsed</li>\n</ul>\n<h4>10.2.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Split the Feedback Requests section of the sidebar into sections for Open, Approved and Needs Work</li>\n    <li>When selecting a ticket to start work, added an option to pull latest if base branch is behind origin</li>\n    <li>Added the ability to set a default base branch per repo when creating a feature branch</li>\n</ul>\n<h4>10.2.1</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new onboarding flow for some users that guides them through the setup of integrations and creating their first code comment</li>\n    <li>Adds the ability to generate a feedback request after commiting via the JetBrains commit dialog</li>\n    <li>Adds support for remotes using SSH aliases</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>When creating a feedback request only commits from current user are checked by default, and only if they include the most recent commit</li>\n    <li>The list in the Pull Requests section automatically updates when you open, close or merge a pull request from CodeStream</li>\n    <li>The hovers for icons in the editor gutter now make it clear if the discussion was a comment, issue, feedback request or pull request</li>\n    <li>Optimization of git operations to gather commits when creating a feedback request</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where CodeStream would repeatedly reload</li>\n    <li>Fixes an issue that would create an error when clicking on a feedback request due to bad data</li>\n</ul>\n<h4>10.2.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds new onboarding settings for team admins that allow people to join teams based on repository access, and allow admins to restrict integration and authentication options</li>\n    <li>Adds a warning if you have local changes when trying to create a pull request</li>\n    <li>Adds new gear menu to header of the My Team section to access team settings and administration</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where icons, reprsenting comments, wouldn't be displayed in the gutter of pull request diffs</li>\n    <li>Fixes an issue where some users would run into GitHub rate limiting issues when working with pull requests</li>\n    <li>Fixes an issue where the markdown preview for commenting in a pull request was always empty</li>\n    <li>Fixes an issue where adding multiple code blocks to a codemark would result in some not getting added</li>\n    <li>Fixes an issue where a GitHub disconnect banner would incorrectly appear due to lack of internet connectivity</li>\n    <li>Fixes an issue where some users would get stuck on the Loading page trying to get into CodeStream</li>\n</ul>\n<h4>10.1.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the \"Outdated\" label to comments on outdated code displayed in a pull request</li>\n    <li>Improved diff creation for feedback requests so that you should rarley see the “a commit required to perform this review was not found in the local repository” message</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Adds more meta data to hovers for icons in the editor gutter</li>\n    <li>Removed non-contextual items from the CodeStream context menu</li>\n    <li>Setting to not display the + button when hovering in the gutter now takes effect without needing to restart the IDE</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where multiple lines of code displayed in a code fence were collapsed down to a single line</li>\n    <li>Fixes an issue where Start Work would break if selected a CodeStream issue and the branch template used only {id}</li>\n    <li>Fixes an issue where a feedback request couldn't be submitted against a brand new repo with a single commit</li>\n    <li>Fixes an issue with the \"show instructions\" link at the bottom of a feedback request that has replies</li>\n    <li>Fixes an off-by-1 issue in the display of comments on the Conversation tab in pull requests</li>\n</ul>\n<h4>10.1.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue that prevented you from starting a review when commenting in a pull request</li>\n</ul>\n<h4>10.1.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Add an integration with Clubhouse that allows you to create stories and see your backlog</li>\n    <li>Adds the ability to create a GitHub pull request across forks</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Improves the UX on the form to submit a review in a pull request by making it clear that the Cancel button is for cancelling the review, and not dismissing the form</li>\n    <li>Clarifies that when commenting on code outside of the changeset in a pull request, while a review is pending, the comment is added at the PR level and not included in the review</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/191\">#191</a> - Codestream interferes with rebasing in Jetbrains</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/296\">#296</a> - \"Error 401: Unauthorized\" when opening a PR on GitLab Self Managed</li>\n    <li>Fixes an issue where the icons for pull request comments would be displayed on the wrong line in the gutter of the diff</li>\n    <li>Fixes an issue that would result in an error trying to view a pull request</li>\n    <li>Fixes an issue where the viewed status of files in the pull request would get reset after adding a comment</li>\n    <li>Fixes an issue that prevented the creation of single pull request comments with certain GitHub Enterprise instances</li>\n    <li>Fixes an issue where files would not be displayed in tree view of a pull request if the folder name was a superset of another folder name</li>\n</ul>\n<h4>10.0.5</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to react to a comment, issue or feedback request, whereas you previously could only react to a reply</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Changed the default branch name template to just use the issue's title</li>\n    <li>Clicking on an icon in the gutter of a pull-request diff now scrolls you to the corresponding comment</li>\n    <li>Improved logic for naming repositories to prioritize upstream and origin remotes</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue that prevented pull request comments from being displayed immediately as icons in the diff gutter</li>\n    <li>Fixes an issue that would prevent you from viewing a pull request that had a team as a reviewer</li>\n    <li>Fixes an issue that would generate an error if you reloaded while configuring an on-prem issue tracking/code hosting service</li>\n</ul>\n<h4>10.0.4</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new extension setting to turn off the \"+\" compose button on hover in the gutter</li>\n    <li>Adds more space around the \"+\" compose button so that it doesn't interfer with setting a breakpoint</li>\n    <li>Automatically adds the codestream.xml file to your .gitignore</li>\n    <li>Adds the ability to mention GitHub collaborators when commenting on a pull request</li>\n    <li>Adds typeahead search when selecting branches for a new pull request</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>After creating a pull request, when you then close it you are brought to the CodeStream sidebar instead of back to the Open a Pull Request page</li>\n    <li>Provide more guidance for users trying to sign up/in with GitLab regarding the need to have a public primary email on GitLab</li>\n    <li>The \"Work in Progress\" section is now more performant, with reduced api requests</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/322\">#322</a> - When creating a pull request on GitLab or Bitbucket, CodeStream would try to open it in the IDE instead of on the appropriate service</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/315\">#315</a> - Creating a PR on GitLab Self-Managed switches base branch with compare branch</li>\n    <li>Fixes an issue trying to view a pull request in a repo with more than 100 open or merged pull requests</li>\n    <li>Fixes an issue where our polling for updates to a pull request would trigger an error when the user comes back from beign offline</li>\n    <li>Fixes an issue with Open Local File not working from the Files Changed tab in a pull request</li>\n    <li>Fixes an issue that would prevent you from creating a pull request if you had repos from both GitHub and GitHub Entperise open in your IDE</li>\n</ul>\n<h4>10.0.3</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new \"+\" in the editor gutter, when you either hover or select a code block, for adding comment codemarks</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>After creating a pull request on GitHub Enterprise you are now taken right into the newly created pull request on CodeStream</li>\n    <li>Toast notifications for when you're added as a reviewer or assignee to a pull request are now not limited to open pull requests</li>\n    <li>Better messaging when you try to create a pull request with no repositories open</li>\n    <li>Updated Slack app to use Slack's new granular permissions</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where clicking on a toast notification for a comment in a review would take you to the individual comment view, and not to the review</li>\n    <li>Fixes an issue where CodeStream would not properly initialize until the tool window is expanded</li>\n    <li>Fixes an issue where pull requests from older versions of GitHub Enterprise wouldn't load</li>\n    <li>Fixes an issue where the list of projects and the list of assignees where not list alphabetically when creating an issue on Azure DevOps</li>\n    <li>Fixes an issue where you'd receive a toast notification when assiging a pull request to yourself</li>\n    <li>Fixes an issue where the default notifications settings weren't being reflected on the Notifications page for new users</li>\n    <li>Fixes an issue where the editing of a range in a mult-range codemark caused a change in the ordering of the ranges</li>\n    <li>Fixes an issue with some modals having two \"X\"s to dismiss</li>\n    <li>Fixes an issue with ESC not properly dismissing modals/pages</li>\n    <li>Fixes an issue where certain actions would inappropriately land you in spatial view</li>\n</ul>\n<h4>10.0.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability, in a codemark with multiple code blocks, to intersperse the blocks of code in the codemark text by refencing them with `[#1]`</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Changed reference to \"requested a review\" in activity feed to \"requested feedback\"</li>\n    <li>Replaces \"upgrade\" link under headshot menu with sales@codestream.com for on-prem customers</li>\n    <li>Makes the CodeStream context menu options available while the IDE is in dumb mode</li>\n    <li>Improve performance and reduce memory usage by caching some expensive git operations</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/301\">#301</a> - Creating Feedback Request fails</li>\n    <li>Fixes an issue where, after adding a code comment in a pull request, the icon in the diff gutter would not appear immediately</li>\n    <li>Fixes an issue where creating a pull request or feedback request from the WIP section didn't default to the correct repo</li>\n    <li>Fixes an issue with \"/dev/null\" entries appearing in list of files when creating a pull request</li>\n    <li>Fixes an issue with the CodeStream pane missing a tool window title</li>\n    <li>Fixes an issue with the CodeStream context menu missing an icon</li>\n</ul>\n<h4>10.0.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where authentication with your code host would seem to fail if you didn't have a repo from that code host open in your IDE</li>\n</ul>\n<h4>10.0.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to submit a review in a pull request without having to first start a review via a code comment</li>\n    <li>Code Reviews have been renamed Feedback Requests to better reflect the fact that they are more informal, and are used more frequently, to get feedback on your work in progress throughout the development process</li>\n    <li>Adds the ability to jump to your local version of a file from any comment in a pull request</li>\n    <li>Adds two new ways to view changes in a pull request. Tree view, which is similar to the current List view, but organizes the files as they’d appear in a source tree. And Diff Hunks view, which is the same view you’re used to seeing on GitHub. List and Tree view provide full-file context, whereas Diff Hunks shows just the lines that changed.</li>\n    <li>In any of the three views, mark any file as not viewed if you want to indicate to yourself that you need to come back to it again</li>\n    <li>Adds a new Data Export tool, for team admins only, that dumps all code comments (including those done in a feedback request) in CSV format</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>All-new tree based UI persistently exposes everything you need access to, and everything you need to do</li>\n    <li>The interface for commenting on code has been improved so that you’re clear on what code block, if any, has been selected. It’s also easier to add additional ranges.</li>\n    <li>When there’s a diff between the code in a codemark and the version you have locally, the original version, the current version, and a diff are all included in the codemark. No need to open a separate diff.</li>\n    <li>The Pull Requests section of the sidebar now includes a “Recent” section that shows you your five most recently created PRs, regardless of their current state.</li>\n    <li>When reviewing a pull request and commenting on code that isn't part of the changeset, it's now clear that the comment will be added as a PR-level comment and not as part of the review (due to GitHub's limitations)</li>\n    <li>When in spatial view of codemarks, there are now clearer indicators of when there are other codemarks above or below the fold</li>\n    <li>Diff is now automatically closed when you close a pull request's view</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where the Work in Progress section would not update unless you first visited the Team tab</li>\n</ul>\n<h4>9.1.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds toast notifications for when you've been assigned a new pull request that opens the PR in your IDE</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Implemented Google's diff-match-patch as a fallback for maintaining the location of all markers and pull-request comments</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with long delays in opening diffs in a code review</li>\n    <li>Fixes an issue where the status of viewed files in a PR would get reset if you cancelled the submission of a comment</li>\n    <li>Fixes an issue with codemarks being displayed at the top of a file rather than their correct location</li>\n    <li>Fixes an issue preventing users from creating pull request comments on the last line of a file</li>\n    <li>Fixes an issue that prevented you from closing a pull request from CodeStream</li>\n    <li>Fixes an issue where you couldn't open a pull request diff immediately after opening the repo</li>\n    <li>Fixes an issue where the \"Rebase &amp; merge\" button in a PR wouldn't work without a reload</li>\n</ul>\n<h4>9.0.4</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for native navigation of pull requests (i.e., F7, arrows)</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where you'd get an error about not having the repo open, when you actually did, when trying to comment on a pull request</li>\n    <li>Fixes an issue with the GitHub Enterprise configuration step being skipped when connecting from the Pull Requests section of the Tasks tab</li>\n    <li>Fixes an issue with the required/suggested version roadblock display</li>\n</ul>\n<h4>9.0.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Better error handling for the GitHub pull-request integration, particularly around OAuth issues</li>\n    <li>Adds support for Kerberos when creating pull requests from CodeStream</li>\n    <li>Pull requests now reflect require-reviewers status</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Removed the 5-person team size limit for companies on CodeStream's Free plan</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where the icon would not appear in the editor gutter right away for a newly created codemark</li>\n    <li>Fixes an issue with opening a PR from a repo that you no longer have locally</li>\n    <li>Fixes an issue with the caching of GitHub access tokens</li>\n</ul>\n<h4>9.0.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with the creation of pull requests</li>\n</ul>\n<h4>9.0.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for GitHub templates when creating a pull request</li>\n    <li>Adds the ability to create custom GitHub queries to control which pull requests are displayed on the Tasks tab</li>\n    <li>Adds the ability to quickly name a code review or pull request based on ticket name, branch name or commit message</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Display of pull requests on the Tasks tab is now broken into sections for Waiting on My Review, Assigned to Me, and Created by Me</li>\n    <li>By default, only pull requests associated with repos you have open in your IDE are display, but you also have the ability to show all pull requests</li>\n    <li>Allows for the selection of remote branches when creating a PR</li>\n    <li>On the Search tab you can now use multiple `tag` arguments to create an AND query</li>\n    <li>When the Current File tab is in list view, multi-range codemarks are now only listed once</li>\n    <li>When creating a codemark, we now remember the last state of the checkbox(es) for any non-member notifications</li>\n    <li>Move cloud authentication options to the top of the signup page</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where you couldn't paste strings containing single quotes</li>\n    <li>Fixes an issue with creating codemarks in cshtml files</li>\n    <li>Fixes an issue with creating codemarks in a file in a renamed folder on the file system with a new name that varies only by case</li>\n    <li>Fixes an issue where the position of codemarks could not be determined</li>\n</ul>\n","dependencies":["com.intellij.modules.platform","Git4Idea"],"since":"202.6397","sourceCodeUrl":"https://github.com/TeamCodeStream/codestream","size":318157919}